# **Pandas - DataFrames!**

#### **Claurusway Lesson Repeats.. Thanks to our teacher Pat Parton...**

**Create a DataFrame!**

In [363]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [364]:
pd.DataFrame(data)

       0      1
0  terry  quinn

In [365]:
pd.DataFrame(data, columns = ['first_col', 'second_col'])

  first_col second_col
0     terry      quinn

**M**

In [366]:
data2 = np.arange(1,10).reshape(3,3)
data2

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

**M**

In [367]:
pd.DataFrame(data2, columns = ['var1','var2','var3'])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [368]:
data3 = np.arange(1,101).reshape(25, 4)
data3

array([[  1,   2,   3,   4],
       [  5,   6,   7,   8],
       [  9,  10,  11,  12],
       [ 13,  14,  15,  16],
       [ 17,  18,  19,  20],
       [ 21,  22,  23,  24],
       [ 25,  26,  27,  28],
       [ 29,  30,  31,  32],
       [ 33,  34,  35,  36],
       [ 37,  38,  39,  40],
       [ 41,  42,  43,  44],
       [ 45,  46,  47,  48],
       [ 49,  50,  51,  52],
       [ 53,  54,  55,  56],
       [ 57,  58,  59,  60],
       [ 61,  62,  63,  64],
       [ 65,  66,  67,  68],
       [ 69,  70,  71,  72],
       [ 73,  74,  75,  76],
       [ 77,  78,  79,  80],
       [ 81,  82,  83,  84],
       [ 85,  86,  87,  88],
       [ 89,  90,  91,  92],
       [ 93,  94,  95,  96],
       [ 97,  98,  99, 100]])

In [369]:
df3 = pd.DataFrame(data3, columns = ['var1','var2','var3','var4'])
df3

    var1  var2  var3  var4
0      1     2     3     4
1      5     6     7     8
2      9    10    11    12
3     13    14    15    16
4     17    18    19    20
5     21    22    23    24
6     25    26    27    28
7     29    30    31    32
8     33    34    35    36
9     37    38    39    40
10    41    42    43    44
11    45    46    47    48
12    49    50    51    52
13    53    54    55    56
14    57    58    59    60
15    61    62    63    64
16    65    66    67    68
17    69    70    71    72
18    73    74    75    76
19    77    78    79    80
20    81    82    83    84
21    85    86    87    88
22    89    90    91    92
23    93    94    95    96
24    97    98    99   100

**M**

In [370]:
df3.head()

   var1  var2  var3  var4
0     1     2     3     4
1     5     6     7     8
2     9    10    11    12
3    13    14    15    16
4    17    18    19    20

In [371]:
df3.tail()

    var1  var2  var3  var4
20    81    82    83    84
21    85    86    87    88
22    89    90    91    92
23    93    94    95    96
24    97    98    99   100

In [372]:
df3.tail(3)

    var1  var2  var3  var4
22    89    90    91    92
23    93    94    95    96
24    97    98    99   100

In [373]:
df3.sample(frac=.25)

    var1  var2  var3  var4
21    85    86    87    88
2      9    10    11    12
3     13    14    15    16
24    97    98    99   100
6     25    26    27    28
14    57    58    59    60

In [374]:
df3.sample(n=2)

    var1  var2  var3  var4
5     21    22    23    24
21    85    86    87    88

In [375]:
df3.columns

Index(['var1', 'var2', 'var3', 'var4'], dtype='object')

In [376]:
type(df3.columns)

pandas.core.indexes.base.Index

In [377]:
for _ in df3.columns:
    print(_)

var1
var2
var3
var4

In [378]:
df3[['var1','var2']]

    var1  var2
0      1     2
1      5     6
2      9    10
3     13    14
4     17    18
5     21    22
6     25    26
7     29    30
8     33    34
9     37    38
10    41    42
11    45    46
12    49    50
13    53    54
14    57    58
15    61    62
16    65    66
17    69    70
18    73    74
19    77    78
20    81    82
21    85    86
22    89    90
23    93    94
24    97    98

In [379]:
df3.columns = ['newcol1', 'newcol2', 'newcol3', 'newcol4']
df3

    newcol1  newcol2  newcol3  newcol4
0         1        2        3        4
1         5        6        7        8
2         9       10       11       12
3        13       14       15       16
4        17       18       19       20
5        21       22       23       24
6        25       26       27       28
7        29       30       31       32
8        33       34       35       36
9        37       38       39       40
10       41       42       43       44
11       45       46       47       48
12       49       50       51       52
13       53       54       55       56
14       57       58       59       60
15       61       62       63       64
16       65       66       67       68
17       69       70       71       72
18       73       74       75       76
19       77       78       79       80
20       81       82       83       84
21       85       86       87       88
22       89       90       91       92
23       93       94       95       96
24       97       98       99      100

In [380]:
df3.shape

(25, 4)

In [381]:
df3.ndim

2

In [382]:
df3.size

100

In [383]:
#PanDaS   Panel = 3d

**First copy df3 result above, then use the code below!**

In [384]:
pd.read_clipboard()

             newcol2   newcol3   newcol4
   newcol1
0  1                2         3        4
1  5                6         7        8
2  9               10        11       12
3  13              14        15       16
4  17              18        19       20
5  21              22        23       24
6  25              26        27       28
7  29              30        31       32
8  33              34        35       36
9  37              38        39       40
10 41              42        43       44
11 45              46        47       48
12 49              50        51       52
13 53              54        55       56
14 57              58        59       60
15 61              62        63       64
16 65              66        67       68
17 69              70        71       72
18 73              74        75       76
19 77              78        79       80
20 81              82        83       84
21 85              86        87       88
22 89              90        91       92
23 93              94        95       96
24 97              98        99      100

In [385]:
for elem in dir(pd):
    if elem.startswith('read'):
        print(elem)

read_clipboard
read_csv
read_excel
read_feather
read_fwf
read_gbq
read_hdf
read_html
read_json
read_orc
read_parquet
read_pickle
read_sas
read_spss
read_sql
read_sql_query
read_sql_table
read_stata
read_table
read_xml

In [386]:
with open('data.csv', 'w') as fh:
    fh.write('1,2,3')

In [265]:
df = pd.read_csv('data.csv')
df

Empty DataFrame
Columns: [1, 2, 3]
Index: []

In [266]:
help(pd.read_csv)

Help on function read_csv in module pandas.io.parsers.readers:

read_csv(filepath_or_buffer: 'FilePathOrBuffer', sep=<no_default>, delimiter=None, header='infer', names=<no_default>, index_col=None, usecols=None, squeeze=False, prefix=<no_default>, mangle_dupe_cols=True, dtype: 'DtypeArg | None' = None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, cache_dates=True, iterator=False, chunksize=None, compression='infer', thousands=None, decimal: 'str' = '.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, encoding_errors: 'str | None' = 'strict', dialect=None, error_bad_lines=None, warn_bad_lines=None, on_bad_lines=None, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None, storage_options: 'StorageOptions' = None)
    Read a comma-separated values (csv) file into DataFrame.

    Also supports optionally iterating or breaking of the file
    into chunks.

    Additional help can be found in the online docs for
    `IO Tools <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>`_.

    Parameters
    ----------
    filepath_or_buffer : str, path object or file-like object
        Any valid string path is acceptable. The string could be a URL. Valid
        URL schemes include http, ftp, s3, gs, and file. For file URLs, a host is
        expected. A local file could be: file://localhost/path/to/table.csv.

        If you want to pass in a path object, pandas accepts any ``os.PathLike``.

        By file-like object, we refer to objects with a ``read()`` method, such as
        a file handle (e.g. via builtin ``open`` function) or ``StringIO``.
    sep : str, default ','
        Delimiter to use. If sep is None, the C engine cannot automatically detect
        the separator, but the Python parsing engine can, meaning the latter will
        be used and automatically detect the separator by Python's builtin sniffer
        tool, ``csv.Sniffer``. In addition, separators longer than 1 character and
        different from ``'\s+'`` will be interpreted as regular expressions and
        will also force the use of the Python parsing engine. Note that regex
        delimiters are prone to ignoring quoted data. Regex example: ``'\r\t'``.
    delimiter : str, default ``None``
        Alias for sep.
    header : int, list of int, default 'infer'
        Row number(s) to use as the column names, and the start of the
        data.  Default behavior is to infer the column names: if no names
        are passed the behavior is identical to ``header=0`` and column
        names are inferred from the first line of the file, if column
        names are passed explicitly then the behavior is identical to
        ``header=None``. Explicitly pass ``header=0`` to be able to
        replace existing names. The header can be a list of integers that
        specify row locations for a multi-index on the columns
        e.g. [0,1,3]. Intervening rows that are not specified will be
        skipped (e.g. 2 in this example is skipped). Note that this
        parameter ignores commented lines and empty lines if
        ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
        data rather than the first line of the file.
    names : array-like, optional
        List of column names to use. If the file contains a header row,
        then you should explicitly pass ``header=0`` to override the column names.
        Duplicates in this list are not allowed.
    index_col : int, str, sequence of int / str, or False, default ``None``
      Column(s) to use as the row labels of the ``DataFrame``, either given as
      string name or column index. If a sequence of int / str is given, a
      MultiIndex is used.

      Note: ``index_col=False`` can be used to force pandas to *not* use the first
      column as the index, e.g. when you have a malformed file with delimiters at
      the end of each line.
    usecols : list-like or callable, optional
        Return a subset of the columns. If list-like, all elements must either
        be positional (i.e. integer indices into the document columns) or strings
        that correspond to column names provided either by the user in `names` or
        inferred from the document header row(s). For example, a valid list-like
        `usecols` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
        Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
        To instantiate a DataFrame from ``data`` with element order preserved use
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]`` for columns
        in ``['foo', 'bar']`` order or
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
        for ``['bar', 'foo']`` order.

        If callable, the callable function will be evaluated against the column
        names, returning names where the callable function evaluates to True. An
        example of a valid callable argument would be ``lambda x: x.upper() in
        ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
        parsing time and lower memory usage.
    squeeze : bool, default False
        If the parsed data only contains one column then return a Series.
    prefix : str, optional
        Prefix to add to column numbers when no header, e.g. 'X' for X0, X1, ...
    mangle_dupe_cols : bool, default True
        Duplicate columns will be specified as 'X', 'X.1', ...'X.N', rather than
        'X'...'X'. Passing in False will cause data to be overwritten if there
        are duplicate names in the columns.
    dtype : Type name or dict of column -> type, optional
        Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32,
        'c': 'Int64'}
        Use `str` or `object` together with suitable `na_values` settings
        to preserve and not interpret dtype.
        If converters are specified, they will be applied INSTEAD
        of dtype conversion.
    engine : {'c', 'python'}, optional
        Parser engine to use. The C engine is faster while the python engine is
        currently more feature-complete.
    converters : dict, optional
        Dict of functions for converting values in certain columns. Keys can either
        be integers or column labels.
    true_values : list, optional
        Values to consider as True.
    false_values : list, optional
        Values to consider as False.
    skipinitialspace : bool, default False
        Skip spaces after delimiter.
    skiprows : list-like, int or callable, optional
        Line numbers to skip (0-indexed) or number of lines to skip (int)
        at the start of the file.

        If callable, the callable function will be evaluated against the row
        indices, returning True if the row should be skipped and False otherwise.
        An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
    skipfooter : int, default 0
        Number of lines at bottom of file to skip (Unsupported with engine='c').
    nrows : int, optional
        Number of rows of file to read. Useful for reading pieces of large files.
    na_values : scalar, str, list-like, or dict, optional
        Additional strings to recognize as NA/NaN. If dict passed, specific
        per-column NA values.  By default the following values are interpreted as
        NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
        '1.#IND', '1.#QNAN', '<NA>', 'N/A', 'NA', 'NULL', 'NaN', 'n/a',
        'nan', 'null'.
    keep_default_na : bool, default True
        Whether or not to include the default NaN values when parsing the data.
        Depending on whether `na_values` is passed in, the behavior is as follows:

        * If `keep_default_na` is True, and `na_values` are specified, `na_values`
          is appended to the default NaN values used for parsing.
        * If `keep_default_na` is True, and `na_values` are not specified, only
          the default NaN values are used for parsing.
        * If `keep_default_na` is False, and `na_values` are specified, only
          the NaN values specified `na_values` are used for parsing.
        * If `keep_default_na` is False, and `na_values` are not specified, no
          strings will be parsed as NaN.

        Note that if `na_filter` is passed in as False, the `keep_default_na` and
        `na_values` parameters will be ignored.
    na_filter : bool, default True
        Detect missing value markers (empty strings and the value of na_values). In
        data without any NAs, passing na_filter=False can improve the performance
        of reading a large file.
    verbose : bool, default False
        Indicate number of NA values placed in non-numeric columns.
    skip_blank_lines : bool, default True
        If True, skip over blank lines rather than interpreting as NaN values.
    parse_dates : bool or list of int or names or list of lists or dict, default False
        The behavior is as follows:

        * boolean. If True -> try parsing the index.
        * list of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
          each as a separate date column.
        * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
          a single date column.
        * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call
          result 'foo'

        If a column or index cannot be represented as an array of datetimes,
        say because of an unparsable value or a mixture of timezones, the column
        or index will be returned unaltered as an object data type. For
        non-standard datetime parsing, use ``pd.to_datetime`` after
        ``pd.read_csv``. To parse an index or column with a mixture of timezones,
        specify ``date_parser`` to be a partially-applied
        :func:`pandas.to_datetime` with ``utc=True``. See
        :ref:`io.csv.mixed_timezones` for more.

        Note: A fast-path exists for iso8601-formatted dates.
    infer_datetime_format : bool, default False
        If True and `parse_dates` is enabled, pandas will attempt to infer the
        format of the datetime strings in the columns, and if it can be inferred,
        switch to a faster method of parsing them. In some cases this can increase
        the parsing speed by 5-10x.
    keep_date_col : bool, default False
        If True and `parse_dates` specifies combining multiple columns then
        keep the original columns.
    date_parser : function, optional
        Function to use for converting a sequence of string columns to an array of
        datetime instances. The default uses ``dateutil.parser.parser`` to do the
        conversion. Pandas will try to call `date_parser` in three different ways,
        advancing to the next if an exception occurs: 1) Pass one or more arrays
        (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
        string values from the columns defined by `parse_dates` into a single array
        and pass that; and 3) call `date_parser` once for each row using one or
        more strings (corresponding to the columns defined by `parse_dates`) as
        arguments.
    dayfirst : bool, default False
        DD/MM format dates, international and European format.
    cache_dates : bool, default True
        If True, use a cache of unique, converted dates to apply the datetime
        conversion. May produce significant speed-up when parsing duplicate
        date strings, especially ones with timezone offsets.

        .. versionadded:: 0.25.0
    iterator : bool, default False
        Return TextFileReader object for iteration or getting chunks with
        ``get_chunk()``.

        .. versionchanged:: 1.2

           ``TextFileReader`` is a context manager.
    chunksize : int, optional
        Return TextFileReader object for iteration.
        See the `IO Tools docs
        <https://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
        for more information on ``iterator`` and ``chunksize``.

        .. versionchanged:: 1.2

           ``TextFileReader`` is a context manager.
    compression : {'infer', 'gzip', 'bz2', 'zip', 'xz', None}, default 'infer'
        For on-the-fly decompression of on-disk data. If 'infer' and
        `filepath_or_buffer` is path-like, then detect compression from the
        following extensions: '.gz', '.bz2', '.zip', or '.xz' (otherwise no
        decompression). If using 'zip', the ZIP file must contain only one data
        file to be read in. Set to None for no decompression.
    thousands : str, optional
        Thousands separator.
    decimal : str, default '.'
        Character to recognize as decimal point (e.g. use ',' for European data).
    lineterminator : str (length 1), optional
        Character to break file into lines. Only valid with C parser.
    quotechar : str (length 1), optional
        The character used to denote the start and end of a quoted item. Quoted
        items can include the delimiter and it will be ignored.
    quoting : int or csv.QUOTE_* instance, default 0
        Control field quoting behavior per ``csv.QUOTE_*`` constants. Use one of
        QUOTE_MINIMAL (0), QUOTE_ALL (1), QUOTE_NONNUMERIC (2) or QUOTE_NONE (3).
    doublequote : bool, default ``True``
       When quotechar is specified and quoting is not ``QUOTE_NONE``, indicate
       whether or not to interpret two consecutive quotechar elements INSIDE a
       field as a single ``quotechar`` element.
    escapechar : str (length 1), optional
        One-character string used to escape other characters.
    comment : str, optional
        Indicates remainder of line should not be parsed. If found at the beginning
        of a line, the line will be ignored altogether. This parameter must be a
        single character. Like empty lines (as long as ``skip_blank_lines=True``),
        fully commented lines are ignored by the parameter `header` but not by
        `skiprows`. For example, if ``comment='#'``, parsing
        ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in 'a,b,c' being
        treated as the header.
    encoding : str, optional
        Encoding to use for UTF when reading/writing (ex. 'utf-8'). `List of Python
        standard encodings
        <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .

        .. versionchanged:: 1.2

           When ``encoding`` is ``None``, ``errors="replace"`` is passed to
           ``open()``. Otherwise, ``errors="strict"`` is passed to ``open()``.
           This behavior was previously only the case for ``engine="python"``.

        .. versionchanged:: 1.3.0

           ``encoding_errors`` is a new argument. ``encoding`` has no longer an
           influence on how encoding errors are handled.

    encoding_errors : str, optional, default "strict"
        How encoding errors are treated. `List of possible values
        <https://docs.python.org/3/library/codecs.html#error-handlers>`_ .

        .. versionadded:: 1.3.0

    dialect : str or csv.Dialect, optional
        If provided, this parameter will override values (default or not) for the
        following parameters: `delimiter`, `doublequote`, `escapechar`,
        `skipinitialspace`, `quotechar`, and `quoting`. If it is necessary to
        override values, a ParserWarning will be issued. See csv.Dialect
        documentation for more details.
    error_bad_lines : bool, default ``None``
        Lines with too many fields (e.g. a csv line with too many commas) will by
        default cause an exception to be raised, and no DataFrame will be returned.
        If False, then these "bad lines" will be dropped from the DataFrame that is
        returned.

        .. deprecated:: 1.3.0
           The ``on_bad_lines`` parameter should be used instead to specify behavior upon
           encountering a bad line instead.
    warn_bad_lines : bool, default ``None``
        If error_bad_lines is False, and warn_bad_lines is True, a warning for each
        "bad line" will be output.

        .. deprecated:: 1.3.0
           The ``on_bad_lines`` parameter should be used instead to specify behavior upon
           encountering a bad line instead.
    on_bad_lines : {'error', 'warn', 'skip'}, default 'error'
        Specifies what to do upon encountering a bad line (a line with too many fields).
        Allowed values are :

            - 'error', raise an Exception when a bad line is encountered.
            - 'warn', raise a warning when a bad line is encountered and skip that line.
            - 'skip', skip bad lines without raising or warning when they are encountered.

        .. versionadded:: 1.3.0

    delim_whitespace : bool, default False
        Specifies whether or not whitespace (e.g. ``' '`` or ``'    '``) will be
        used as the sep. Equivalent to setting ``sep='\s+'``. If this option
        is set to True, nothing should be passed in for the ``delimiter``
        parameter.
    low_memory : bool, default True
        Internally process the file in chunks, resulting in lower memory use
        while parsing, but possibly mixed type inference.  To ensure no mixed
        types either set False, or specify the type with the `dtype` parameter.
        Note that the entire file is read into a single DataFrame regardless,
        use the `chunksize` or `iterator` parameter to return the data in chunks.
        (Only valid with C parser).
    memory_map : bool, default False
        If a filepath is provided for `filepath_or_buffer`, map the file object
        directly onto memory and access the data directly from there. Using this
        option can improve performance because there is no longer any I/O overhead.
    float_precision : str, optional
        Specifies which converter the C engine should use for floating-point
        values. The options are ``None`` or 'high' for the ordinary converter,
        'legacy' for the original lower precision pandas converter, and
        'round_trip' for the round-trip converter.

        .. versionchanged:: 1.2

    storage_options : dict, optional
        Extra options that make sense for a particular storage connection, e.g.
        host, port, username, password, etc. For HTTP(S) URLs the key-value pairs
        are forwarded to ``urllib`` as header options. For other URLs (e.g.
        starting with "s3://", and "gcs://") the key-value pairs are forwarded to
        ``fsspec``. Please see ``fsspec`` and ``urllib`` for more details.

        .. versionadded:: 1.2

    Returns
    -------
    DataFrame or TextParser
        A comma-separated values (csv) file is returned as two-dimensional
        data structure with labeled axes.

    See Also
    --------
    DataFrame.to_csv : Write DataFrame to a comma-separated values (csv) file.
    read_csv : Read a comma-separated values (csv) file into DataFrame.
    read_fwf : Read a table of fixed-width formatted lines into DataFrame.

    Examples
    --------
    >>> pd.read_csv('data.csv')  # doctest: +SKIP

**Insert index and column names!**

In [163]:
import numpy as np
import pandas as pd

In [164]:
data = np.array([1, 2, 5, 6])
data

array([1, 2, 5, 6])

In [165]:
pd.DataFrame(data=data,
             columns=['coll'],
             index=['a', 'b', 'c', 'd']
             )

   coll
a     1
b     2
c     5
d     6

**Insert them after creating a data frame by arange()!**

In [166]:
pd.DataFrame(np.arange(1,24,2).reshape(3,4))

    0   1   2   3
0   1   3   5   7
1   9  11  13  15
2  17  19  21  23

In [167]:
df = pd.DataFrame(np.arange(1,24,2).reshape(3,4),
             columns = ['var1', 'var2', 'var3', 'var4']
             )
df

   var1  var2  var3  var4
0     1     3     5     7
1     9    11    13    15
2    17    19    21    23

In [168]:
df.head()

   var1  var2  var3  var4
0     1     3     5     7
1     9    11    13    15
2    17    19    21    23

In [169]:
df.tail(2)

   var1  var2  var3  var4
1     9    11    13    15
2    17    19    21    23

In [170]:
df.sample(n=3)

   var1  var2  var3  var4
2    17    19    21    23
1     9    11    13    15
0     1     3     5     7

In [171]:
df.sample()

   var1  var2  var3  var4
0     1     3     5     7

In [172]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [173]:
df.columns

Index(['var1', 'var2', 'var3', 'var4'], dtype='object')

In [174]:
for i in df.columns:
    print(i)

var1
var2
var3
var4

In [175]:
print(*df.columns)

var1 var2 var3 var4

**Change column names!**

In [176]:
df.columns = (33,44,55,66)
df

   33  44  55  66
0   1   3   5   7
1   9  11  13  15
2  17  19  21  23

In [177]:
df.shape

(3, 4)

In [178]:
df.ndim

2

In [179]:
df.size

12

In [180]:
type(df)

pandas.core.frame.DataFrame

In [146]:
df[33]

0     1
1     9
2    17
Name: 33, dtype: int32

In [147]:
type(df[33])

pandas.core.series.Series

In [181]:
type(df[33].values)

numpy.ndarray

In [182]:
type(df.columns)

pandas.core.indexes.numeric.Int64Index

**Create arrays by randint, then dictionary, then DataFrame**

In [183]:
type(df.columns.values)

numpy.ndarray

In [186]:
s2

array([8, 7, 9, 5])

In [187]:
s3

array([14, 13, 14,  9])

In [188]:
my_dict = {'var1': s1, 'var2': s2, 'var3': s3}
my_dict

{'var1': array([9, 2, 7, 8]),
 'var2': array([8, 7, 9, 5]),
 'var3': array([14, 13, 14,  9])}

In [189]:
pd.DataFrame(my_dict)

   var1  var2  var3
0     9     8    14
1     2     7    13
2     7     9    14
3     8     5     9

**Create DataFrame from dictionary!**

In [190]:
pd.DataFrame(
    data = {'quinn': np.random.randint(2,10, size=2),
            'pat': np.ones((2,)),
            'mike': np.zeros((2,))},
    index=['red', 'blue'],
    dtype=np.int16)

      quinn  pat  mike
red       3    1     0
blue      3    1     0

**Create a DataFrame from csv file!**

In [191]:
df = pd.read_csv('C:\\Users\\husey\\Desktop\\python\\src\\ornekcsv.csv')
df

       a;b;c
0    78;12;1
1    78;12;2
2   78;324;3
3      7;2;4
4    88;23;5
5       6;2;
6    56;11;6
7     7;12;7
8    56;21;7
9    346;2;8
10     5;1;8
11  456;21;8
12   3;12;88

In [192]:
df = pd.read_csv('C:\\Users\\husey\\Desktop\\python\\src\\ornekcsv.csv', delimiter=';')
df.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [193]:
df[1:3]

    a    b    c
1  78   12  2.0
2  78  324  3.0

In [194]:
df1 = pd.DataFrame(my_dict)
df1

   var1  var2  var3
0     9     8    14
1     2     7    13
2     7     9    14
3     8     5     9

**Change index names and reach them!**

In [195]:
df1.index = ['a', 'b', 'c', 'd']
df1

   var1  var2  var3
a     9     8    14
b     2     7    13
c     7     9    14
d     8     5     9

In [196]:
df1['a': 'c']

   var1  var2  var3
a     9     8    14
b     2     7    13
c     7     9    14

In [197]:
'var1' in df1

True

In [198]:
'a' in df1.index

True

In [199]:
df

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

**Is this phrase present in DataFrame?**

In [200]:
df.isin([5])

        a      b      c
0   False  False  False
1   False  False  False
2   False  False  False
3   False  False  False
4   False  False   True
5   False  False  False
6   False  False  False
7   False  False  False
8   False  False  False
9   False  False  False
10   True  False  False
11  False  False  False
12  False  False  False

In [201]:
df.isin([5,6,7])

        a      b      c
0   False  False  False
1   False  False  False
2   False  False  False
3    True  False  False
4   False  False   True
5    True  False  False
6   False  False   True
7    True  False   True
8   False  False   True
9   False  False  False
10   True  False  False
11  False  False  False
12  False  False  False

**Create arrays by random.randn()!**

In [202]:
from numpy.random import randn
np.random.seed(100)

In [203]:
np.random.rand()

0.5434049417909654

In [204]:
np.random.rand()

0.27836938509379616

In [205]:
np.random.rand(10)

array([0.42451759, 0.84477613, 0.00471886, 0.12156912, 0.67074908,
       0.82585276, 0.13670659, 0.57509333, 0.89132195, 0.20920212])

In [206]:
np.random.rand(5,5)

array([[0.18532822, 0.10837689, 0.21969749, 0.97862378, 0.81168315],
       [0.17194101, 0.81622475, 0.27407375, 0.43170418, 0.94002982],
       [0.81764938, 0.33611195, 0.17541045, 0.37283205, 0.00568851],
       [0.25242635, 0.79566251, 0.01525497, 0.59884338, 0.60380454],
       [0.10514769, 0.38194344, 0.03647606, 0.89041156, 0.98092086]])

In [207]:
np.random.seed(100)

In [208]:
np.random.rand()

0.5434049417909654

In [209]:
np.random.rand()

0.27836938509379616

In [210]:
np.random.seed(100)

**Create a Dataframe with index and column names and reach elements!**

In [211]:
df3 = pd.DataFrame(randn(5,4), 
                   index = 'A B C D E'.split(), 
                   columns = 'W V Y Z'.split()
                   )
df3

          W         V         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [212]:
np.random.seed(1)

In [213]:
df3 = pd.DataFrame(randn(5,4), 
                   'a b c d e'.split(), 
                   'w x y z'.split()
                   )
df3

          w         x         y         z
a  1.624345 -0.611756 -0.528172 -1.072969
b  0.865408 -2.301539  1.744812 -0.761207
c  0.319039 -0.249370  1.462108 -2.060141
d -0.322417 -0.384054  1.133769 -1.099891
e -0.172428 -0.877858  0.042214  0.582815

In [273]:
df3 = pd.DataFrame(randn(5,4), 
                    index = 'a b c d e'.split(), 
                    columns = 'w x y z'.split()
                   )
df3

          w         x         y         z
a -0.754398  1.252868  0.512930 -0.298093
b  0.488518 -0.075572  1.131629  1.519817
c  2.185575 -1.396496 -1.444114 -0.504466
d  0.160037  0.876169  0.315635 -2.022201
e -0.306204  0.827975  0.230095  0.762011

In [274]:
df3['y']

a    0.512930
b    1.131629
c   -1.444114
d    0.315635
e    0.230095
Name: y, dtype: float64

In [275]:
df3['y'][1]

1.131629387451427

In [276]:
type(df3['y'])

pandas.core.series.Series

In [277]:
df3[['y']]

          y
a  0.512930
b  1.131629
c -1.444114
d  0.315635
e  0.230095

In [278]:
type(df3[['y']])

pandas.core.frame.DataFrame

In [279]:
df3[['y','x']]

          y         x
a  0.512930  1.252868
b  1.131629 -0.075572
c -1.444114 -1.396496
d  0.315635  0.876169
e  0.230095  0.827975

In [280]:
type(df3[['y','x']])

pandas.core.frame.DataFrame

In [281]:
df3.z

a   -0.298093
b    1.519817
c   -0.504466
d   -2.022201
e    0.762011
Name: z, dtype: float64

In [282]:
df3.y

a    0.512930
b    1.131629
c   -1.444114
d    0.315635
e    0.230095
Name: y, dtype: float64

In [283]:
df3['a':'c']

          w         x         y         z
a -0.754398  1.252868  0.512930 -0.298093
b  0.488518 -0.075572  1.131629  1.519817
c  2.185575 -1.396496 -1.444114 -0.504466

In [284]:
df3['w':'y']

Empty DataFrame
Columns: [w, x, y, z]
Index: []

**Copy DataFrame!**

In [285]:
x = df3.copy()

In [286]:
x.columns = ['A B C D'.split()]
x

          A         B         C         D
a -0.754398  1.252868  0.512930 -0.298093
b  0.488518 -0.075572  1.131629  1.519817
c  2.185575 -1.396496 -1.444114 -0.504466
d  0.160037  0.876169  0.315635 -2.022201
e -0.306204  0.827975  0.230095  0.762011

In [287]:
x['a':'c']

          A         B         C         D
a -0.754398  1.252868  0.512930 -0.298093
b  0.488518 -0.075572  1.131629  1.519817
c  2.185575 -1.396496 -1.444114 -0.504466

In [288]:
df3

          w         x         y         z
a -0.754398  1.252868  0.512930 -0.298093
b  0.488518 -0.075572  1.131629  1.519817
c  2.185575 -1.396496 -1.444114 -0.504466
d  0.160037  0.876169  0.315635 -2.022201
e -0.306204  0.827975  0.230095  0.762011

**Insert a new column!**

In [289]:
df3['x*y'] = df3['x'] * df3['y']
df3

          w         x         y         z       x*y
a -0.754398  1.252868  0.512930 -0.298093  0.642633
b  0.488518 -0.075572  1.131629  1.519817 -0.085519
c  2.185575 -1.396496 -1.444114 -0.504466  2.016700
d  0.160037  0.876169  0.315635 -2.022201  0.276550
e -0.306204  0.827975  0.230095  0.762011  0.190513

In [290]:
df3['xxx'] = 1
df3

          w         x         y         z       x*y  xxx
a -0.754398  1.252868  0.512930 -0.298093  0.642633    1
b  0.488518 -0.075572  1.131629  1.519817 -0.085519    1
c  2.185575 -1.396496 -1.444114 -0.504466  2.016700    1
d  0.160037  0.876169  0.315635 -2.022201  0.276550    1
e -0.306204  0.827975  0.230095  0.762011  0.190513    1

**Drop columns permanently by inplace=True!**

In [291]:
df3.drop(['x*y', 'xxx'], axis=1, inplace=True)
df3

          w         x         y         z
a -0.754398  1.252868  0.512930 -0.298093
b  0.488518 -0.075572  1.131629  1.519817
c  2.185575 -1.396496 -1.444114 -0.504466
d  0.160037  0.876169  0.315635 -2.022201
e -0.306204  0.827975  0.230095  0.762011

### **.loc[] and .iloc[] and their use!**

In [292]:
pd.DataFrame().iloc

**Create a DataFrame by randint() and insert columns!**

In [293]:
m = np.random.randint(1,40, size=[8,4])
m

array([[33, 26, 22, 33],
       [20, 26, 15, 14],
       [21,  7, 14, 16],
       [25, 10,  3,  8],
       [ 6, 37, 38, 22],
       [14, 28, 14, 15],
       [24, 17, 29,  4],
       [ 3, 15,  1, 30]])

In [294]:
df4 = pd.DataFrame(m, columns= ['var1', 'var2', 'var3','var4'])
df4

   var1  var2  var3  var4
0    33    26    22    33
1    20    26    15    14
2    21     7    14    16
3    25    10     3     8
4     6    37    38    22
5    14    28    14    15
6    24    17    29     4
7     3    15     1    30

In [295]:
df4.head(2)

   var1  var2  var3  var4
0    33    26    22    33
1    20    26    15    14

In [296]:
df4.loc[1]

var1    20
var2    26
var3    15
var4    14
Name: 1, dtype: int32

**Attention: loc contains 5.index, but iloc does not!**

In [297]:
df4.loc[2:5]

   var1  var2  var3  var4
2    21     7    14    16
3    25    10     3     8
4     6    37    38    22
5    14    28    14    15

In [298]:
df4.iloc[2:5]

   var1  var2  var3  var4
2    21     7    14    16
3    25    10     3     8
4     6    37    38    22

In [299]:
df4.index = 'a b c d e f g h'.split()
df4

   var1  var2  var3  var4
a    33    26    22    33
b    20    26    15    14
c    21     7    14    16
d    25    10     3     8
e     6    37    38    22
f    14    28    14    15
g    24    17    29     4
h     3    15     1    30

In [300]:
df4.loc['d':'g']

   var1  var2  var3  var4
d    25    10     3     8
e     6    37    38    22
f    14    28    14    15
g    24    17    29     4

In [301]:
df4.loc['d':'g', 'var3']

d     3
e    38
f    14
g    29
Name: var3, dtype: int32

**reach columns in DataFrames!**

In [302]:
df4.loc[:] [['var3']]

   var3
a    22
b    15
c    14
d     3
e    38
f    14
g    29
h     1

In [303]:
df4.loc['d':'g'] [['var3']]

   var3
d     3
e    38
f    14
g    29

#### **df4.iloc(2:5, 2) ------------->  SyntaxError: invalid syntax**

In [304]:
df4

   var1  var2  var3  var4
a    33    26    22    33
b    20    26    15    14
c    21     7    14    16
d    25    10     3     8
e     6    37    38    22
f    14    28    14    15
g    24    17    29     4
h     3    15     1    30

In [305]:
df3.loc['a']

w   -0.754398
x    1.252868
y    0.512930
z   -0.298093
Name: a, dtype: float64

#### **df3 ['a'] -------------->  KeyError: 'a'**

#### **df3.loc['x'] ---------------> KeyError: 'x'**

In [306]:
df3.loc['a', :]

w   -0.754398
x    1.252868
y    0.512930
z   -0.298093
Name: a, dtype: float64

In [307]:
df3.loc[:, 'x']

a    1.252868
b   -0.075572
c   -1.396496
d    0.876169
e    0.827975
Name: x, dtype: float64

In [308]:
df3.iloc[0, :]

w   -0.754398
x    1.252868
y    0.512930
z   -0.298093
Name: a, dtype: float64

#### **df3.loc[:, 0]  ----------->  Keyerror: 0**

**This modul explains python's principles!**

In [309]:
import this

In [310]:
df3.iloc[:, [2]]

          y
a  0.512930
b  1.131629
c -1.444114
d  0.315635
e  0.230095

In [311]:
df3

          w         x         y         z
a -0.754398  1.252868  0.512930 -0.298093
b  0.488518 -0.075572  1.131629  1.519817
c  2.185575 -1.396496 -1.444114 -0.504466
d  0.160037  0.876169  0.315635 -2.022201
e -0.306204  0.827975  0.230095  0.762011

In [312]:
df3.loc[['a', 'd']]

          w         x         y         z
a -0.754398  1.252868  0.512930 -0.298093
d  0.160037  0.876169  0.315635 -2.022201

In [313]:
df3.iloc[0, 1]

1.2528681552332879

**Filter!**

In [314]:
df3[df3 > .5]

          w         x         y         z
a       NaN  1.252868  0.512930       NaN
b       NaN       NaN  1.131629  1.519817
c  2.185575       NaN       NaN       NaN
d       NaN  0.876169       NaN       NaN
e       NaN  0.827975       NaN  0.762011

In [315]:
df3[df3 > .5].isna()

       w      x      y      z
a   True  False  False   True
b   True   True  False  False
c  False   True   True   True
d   True  False   True   True
e   True  False   True  False

In [316]:
(df3 > .5)

       w      x      y      z
a  False   True   True  False
b  False  False   True   True
c   True  False  False  False
d  False   True  False  False
e  False   True  False   True

In [317]:
df3[df3['z']>.5]

          w         x         y         z
b  0.488518 -0.075572  1.131629  1.519817
e -0.306204  0.827975  0.230095  0.762011

In [318]:
df3['z']>.5

a    False
b     True
c    False
d    False
e     True
Name: z, dtype: bool

In [319]:
df3[df3['x']<1]

          w         x         y         z
b  0.488518 -0.075572  1.131629  1.519817
c  2.185575 -1.396496 -1.444114 -0.504466
d  0.160037  0.876169  0.315635 -2.022201
e -0.306204  0.827975  0.230095  0.762011

In [320]:
df3[df3['x']<1][['y']]

          y
b  1.131629
c -1.444114
d  0.315635
e  0.230095

In [321]:
df3[df3['x']<-1]

          w         x         y         z
c  2.185575 -1.396496 -1.444114 -0.504466

In [322]:
df3[df3['x']<-1] [['y', 'z']]

          y         z
c -1.444114 -0.504466

In [323]:
df3[df3['y']>0] [['z', 'w', 'y']]

          z         w         y
a -0.298093 -0.754398  0.512930
b  1.519817  0.488518  1.131629
d -2.022201  0.160037  0.315635
e  0.762011 -0.306204  0.230095

In [324]:
df3['y']>0

a     True
b     True
c    False
d     True
e     True
Name: y, dtype: bool

In [325]:
df3[df3['y']>0]

          w         x         y         z
a -0.754398  1.252868  0.512930 -0.298093
b  0.488518 -0.075572  1.131629  1.519817
d  0.160037  0.876169  0.315635 -2.022201
e -0.306204  0.827975  0.230095  0.762011

In [326]:
df3[df3['y']>0] [['z', 'w', 'y']]

          z         w         y
a -0.298093 -0.754398  0.512930
b  1.519817  0.488518  1.131629
d -2.022201  0.160037  0.315635
e  0.762011 -0.306204  0.230095

In [327]:
df3[(df3['w']>0) & (df3['y']<1)]

          w         x         y         z
c  2.185575 -1.396496 -1.444114 -0.504466
d  0.160037  0.876169  0.315635 -2.022201

In [328]:
df3['w']>0

a    False
b     True
c     True
d     True
e    False
Name: w, dtype: bool

In [329]:
df3['y']<1

a     True
b    False
c     True
d     True
e     True
Name: y, dtype: bool

#### **Python is lazy!**

In [330]:
a = 0

**It does not read 1/0!**

In [331]:
if a and 1/0:
    print('Hey!')

**It reads now!**

In [332]:
if a or 1/0:
    print('Hey!')      # ZeroDivisionError

ZeroDivisionError: division by zero

In [333]:
df3

          w         x         y         z
a -0.754398  1.252868  0.512930 -0.298093
b  0.488518 -0.075572  1.131629  1.519817
c  2.185575 -1.396496 -1.444114 -0.504466
d  0.160037  0.876169  0.315635 -2.022201
e -0.306204  0.827975  0.230095  0.762011

In [334]:
df3.loc[(df3.x > -1), ['x', 'y']]

          x         y
a  1.252868  0.512930
b -0.075572  1.131629
d  0.876169  0.315635
e  0.827975  0.230095

In [335]:
df3[df3.x > -1][['x', 'y']]

          x         y
a  1.252868  0.512930
b -0.075572  1.131629
d  0.876169  0.315635
e  0.827975  0.230095

**Insert a new index**

In [370]:
df3.index

RangeIndex(start=0, stop=5, step=1)

In [371]:
df3.reset_index()
df3

   index         w         x         y         z newix
0      0 -0.754398  1.252868  0.512930 -0.298093    ca
1      1  0.488518 -0.075572  1.131629  1.519817    ny
2      2  2.185575 -1.396496 -1.444114 -0.504466    or
3      3  0.160037  0.876169  0.315635 -2.022201    co
4      4 -0.306204  0.827975  0.230095  0.762011    nh

In [373]:
df3.reset_index(inplace=True)
df3

   level_0  index         w         x         y         z newix
0        0      0 -0.754398  1.252868  0.512930 -0.298093    ca
1        1      1  0.488518 -0.075572  1.131629  1.519817    ny
2        2      2  2.185575 -1.396496 -1.444114 -0.504466    or
3        3      3  0.160037  0.876169  0.315635 -2.022201    co
4        4      4 -0.306204  0.827975  0.230095  0.762011    nh

In [374]:
df3.index = df3['index']
df3

       level_0  index         w         x         y         z newix
index
0            0      0 -0.754398  1.252868  0.512930 -0.298093    ca
1            1      1  0.488518 -0.075572  1.131629  1.519817    ny
2            2      2  2.185575 -1.396496 -1.444114 -0.504466    or
3            3      3  0.160037  0.876169  0.315635 -2.022201    co
4            4      4 -0.306204  0.827975  0.230095  0.762011    nh

**Drop index!**

In [375]:
df3.reset_index(drop=True, inplace=True)
df3

   level_0  index         w         x         y         z newix
0        0      0 -0.754398  1.252868  0.512930 -0.298093    ca
1        1      1  0.488518 -0.075572  1.131629  1.519817    ny
2        2      2  2.185575 -1.396496 -1.444114 -0.504466    or
3        3      3  0.160037  0.876169  0.315635 -2.022201    co
4        4      4 -0.306204  0.827975  0.230095  0.762011    nh

In [376]:
df3.drop(['index'], axis=1, inplace =True)
df3

   level_0         w         x         y         z newix
0        0 -0.754398  1.252868  0.512930 -0.298093    ca
1        1  0.488518 -0.075572  1.131629  1.519817    ny
2        2  2.185575 -1.396496 -1.444114 -0.504466    or
3        3  0.160037  0.876169  0.315635 -2.022201    co
4        4 -0.306204  0.827975  0.230095  0.762011    nh

In [377]:
newix = ['ca', 'ny', 'or', 'co', 'nh']

In [378]:
df3['newix'] = newix
df3

   level_0         w         x         y         z newix
0        0 -0.754398  1.252868  0.512930 -0.298093    ca
1        1  0.488518 -0.075572  1.131629  1.519817    ny
2        2  2.185575 -1.396496 -1.444114 -0.504466    or
3        3  0.160037  0.876169  0.315635 -2.022201    co
4        4 -0.306204  0.827975  0.230095  0.762011    nh

**Make a column index!**

In [379]:
df3.set_index('newix')  # not inplace = True

       level_0         w         x         y         z
newix
ca           0 -0.754398  1.252868  0.512930 -0.298093
ny           1  0.488518 -0.075572  1.131629  1.519817
or           2  2.185575 -1.396496 -1.444114 -0.504466
co           3  0.160037  0.876169  0.315635 -2.022201
nh           4 -0.306204  0.827975  0.230095  0.762011

**Dictionary and translation!**

In [380]:
translate = {
    'italien': 
        {'dove': 'where',
         'che': 'what',
         'chi': 'who',
         },
    'english':
        {'where': 'dove',
         'what': 'che',
         'who': 'chi'
            
         }
    }

In [381]:
list(translate.keys())

['italien', 'english']

In [382]:
translate['italien']

{'dove': 'where', 'che': 'what', 'chi': 'who'}

In [383]:
translate['italien']['dove']

'where'

**Create multi index by zip()!**

In [350]:
outside = ['M1', 'M1', 'M1', 'M2', 'M2', 'M2', 'M3', 'M3', 'M3']
inside = [1,2,3,4,5,6,7,8,9]
multi_index = list(zip(outside, inside))
multi_index

[('M1', 1),
 ('M1', 2),
 ('M1', 3),
 ('M2', 4),
 ('M2', 5),
 ('M2', 6),
 ('M3', 7),
 ('M3', 8),
 ('M3', 9)]

In [351]:
hier_index = pd.MultiIndex.from_tuples(multi_index)
hier_index

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 4),
            ('M2', 5),
            ('M2', 6),
            ('M3', 7),
            ('M3', 8),
            ('M3', 9)],
           )

In [352]:
df5 = pd.DataFrame(np.random.randn(9,4),
                   index=hier_index,
                   columns=['A','B','C','D'])
df5

             A         B         C         D
M1 1 -0.592445  0.882003  0.778838  1.499032
   2  1.542909 -0.447732 -1.777692 -1.791835
   3 -1.005065 -0.400376  0.536258  1.299785
M2 4  0.094180 -0.283169 -0.395713 -0.712432
   5 -1.356346 -0.837716 -0.493911 -0.141446
   6 -0.874671  1.046876  0.269837  0.408915
M3 7 -0.337337  0.110747  0.574400  0.686630
   8  1.723770 -2.421971 -1.501183  0.046399
   9 -0.076532  0.842092  0.367400 -0.511294

In [353]:
df5.loc['M3']

          A         B         C         D
7 -0.337337  0.110747  0.574400  0.686630
8  1.723770 -2.421971 -1.501183  0.046399
9 -0.076532  0.842092  0.367400 -0.511294

**Reach elements by multi index!**

In [385]:
df5.loc['M2'].loc[[5]]

            A         B         C         D
Num
5   -1.356346 -0.837716 -0.493911 -0.141446

In [386]:
df5.loc['M2'].loc[5]

A   -1.356346
B   -0.837716
C   -0.493911
D   -0.141446
Name: 5, dtype: float64

In [387]:
df5.index.names

FrozenList(['Group', 'Num'])

In [388]:
df5.index.names = ['Group', 'Num']
df5

                  A         B         C         D
Group Num
M1    1   -0.592445  0.882003  0.778838  1.499032
      2    1.542909 -0.447732 -1.777692 -1.791835
      3   -1.005065 -0.400376  0.536258  1.299785
M2    4    0.094180 -0.283169 -0.395713 -0.712432
      5   -1.356346 -0.837716 -0.493911 -0.141446
      6   -0.874671  1.046876  0.269837  0.408915
M3    7   -0.337337  0.110747  0.574400  0.686630
      8    1.723770 -2.421971 -1.501183  0.046399
      9   -0.076532  0.842092  0.367400 -0.511294

**Reach elements by xs[]**

In [390]:
df5.xs('M1')

            A         B         C         D
Num
1   -0.592445  0.882003  0.778838  1.499032
2    1.542909 -0.447732 -1.777692 -1.791835
3   -1.005065 -0.400376  0.536258  1.299785

In [391]:
df5.xs(['M1',2])

C:\Users\husey\AppData\Local\Temp/ipykernel_17396/1597791428.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df5.xs(['M1',2])

A    1.542909
B   -0.447732
C   -1.777692
D   -1.791835
Name: (M1, 2), dtype: float64

**Null values!**

In [397]:
np.nan # sort of like none

nan

In [398]:
None

In [399]:
a = None

In [400]:
a is None

True

In [401]:
b = np.nan 
b

nan

In [402]:
t = pd.Series([1,2,3, np.nan])
t

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [403]:
t.mean()

2.0

In [404]:
np.nan == np.NaN

False